---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.IsCalculatedField
source: html/b33bd011-f26c-e617-5b6d-27968c7b09eb.htm
---
# Autodesk.Revit.DB.ScheduleField.IsCalculatedField Property

Indicates if the field is a calculated field (Formula or Percentage).

## Syntax (C#)
```csharp
public bool IsCalculatedField { get; }
```